module.exports = [
    {
        title: "数据结构-基础",
        collapsable: true,
        sidebarDepth: 2,
        children: [
            ['时间空间复杂度计算','时间空间复杂度计算'],
            ['线性表','线性表'],
            ['栈','栈'],
            ['队列','队列'],
            ['字符串','字符串'],
            ['数组','数组'],
            ['矩阵','矩阵'],
            ['广义表','广义表'],
            ['树','树'],
            ['二叉树','二叉树'],
            ['B树(B+树)','B树(B+树)'],
            ['红黑树','红黑树'],
            ['森林','森林'],
            ['图','图'],
            ['堆','堆'],
            ['散列表(Hash表)','散列表(Hash表)']
        ]
    }
];